[
    {
        "user_name": "JoRedd",
        "user_id": "AGYQZEUT6RH4SN7PU2PZ4ZIDS4XA",
        "product_title": "Match Men's Slim Tapered Stretchy Casual Pants",
        "average_rating": 4.3,
        "total_rating": 6231,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Pants, Casual",
        "features": {
            "Fabric type": "97% Cotton, 3% Spandex",
            "Origin": "Imported",
            "Closure type": "Zipper",
            "Inseam": "31 Inches"
        },
        "description": "97% Cotton/ 3% Spandex, thin fabric(stretch), Slightly below waist/ flat front, Slim fit/ Slightly tapered, Two side-seam pockets, two rear welt pockets/ zip fly with button, Suitable for spring & autumn casual wear",
        "product_asin": "B01GPELEFE",
        "review_title": "These pants are amazing as heck! (And some fashion advice for the fellas, please read that)",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "These pants are highly comfortable and REALLY enjoyable to wear when I dress casually/formally and pairing with one of my sport coats or blazers. They are stretchy so you still have plenty of mobility. It's like wearing comfortable slim jeans disguised as casual pants (lol).\n\nFASHION ADVICE: I saw some other reviews of guys talking about \"too long for 6ft and 31in inseam\" but looking at the pictures that they've posted, the pants aren't even sitting at their waist (your waist is just under/at your belly button) They're wearing them like hip pants (many guys think the waist is the hip but it's not) but they are waist pants. The categories are (low hip/hip/Waist/High Waist). Trust me fellas, wearing your pants at your WAIST is very groomed. I know y'all are imagining a nerdy cartoon caricature that has on \"high water(high waist)\" pants but that's not what waist pants are. They give you an even distribution of the upper body and extends your legs in appearance. For my fellas with a gut, it disguises your belly, giving you a slimmer look than when you wear it at the hip and your fat is hanging off the waistline, giving you a sloppier look.",
        "helpful_votes": 14
    },
    {
        "user_name": "ssisyphus",
        "user_id": "AG4RJNBSR3RUND56BUUIN26YMZRQ",
        "product_title": "Repel Umbrella Windproof Travel Umbrellas for Rain - Easy Auto Open Close, Durable & Compact Umbrella, Strong Fiberglass Frame, Waterproof Canopy - Backpack, Purse, Portable Umbrella for Travel",
        "average_rating": 4.5,
        "total_rating": 77416,
        "product_category": "Clothing, Shoes & Jewelry, Luggage & Travel Gear, Umbrellas, Folding Umbrellas",
        "features": {
            "Care instructions": "Hand Wash Only"
        },
        "description": "High-Quality Travel Umbrella: Our black umbrella for rain is crafted with premium materials, ensuring excellent quality and durability. Perfect for any weather, it's a must-have small travel umbrella for all occasions., Strong and Windproof: Engineered with a double-vented canopy and sturdy fiberglass covered frame, our windproof umbrella withstands strong winds and rain. Ideal for travelers needing a reliable, wind-resistant umbrella., Easy To Use Auto Open Close Umbrella: Our collapsible umbrella features an auto open/close function for convenience. It's lightweight and compact, making it a perfect portable umbrella for travel, purse, backpack or car., Built to Last Durability: This travel umbrella compact offers great value with its durable design and premium features. It's a heavy-duty umbrella that provides excellent protection against rain and wind at an affordable price., ",
        "product_asin": "B07DNKZKCL",
        "review_title": "Repels rain and bears",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "This is a great compact umbrella for a good price. We used ours in Alaska this summer to keep us dry.\nAlso we have found that the bright yellow color repels grizzly bears ;-)",
        "helpful_votes": 604
    },
    {
        "user_name": "ashley",
        "user_id": "AFE5RKHWUPDBXFWZUTZD6XEREEXQ",
        "product_title": "Merrell Men's and Women's Wool Everyday Hiking Socks-3 Pair Pack-Cushioned",
        "average_rating": 4.5,
        "total_rating": 5255,
        "product_category": "Clothing, Shoes & Jewelry, Women, Clothing, Active, Athletic Socks",
        "features": {
            "Fabric type": "58% Acrylic, 25% Wool, 15% Nylon, 2% Lycra Spandex",
            "Care instructions": "Machine Wash",
            "Origin": "Imported",
            "Fit type": "Ankle"
        },
        "description": "#1 Outdoor Footwear Brand, Arch support - Merrell short cushion low cut ankle socks have arch band support to give you maximum comfort and protect your feet from fatigue all day long, Reinforced heel and toe - Merrell and hiking socks have reinforced heel and toe which ensures better and longer durability of the sock, so they will last and serve for you year after year, ",
        "product_asin": "B07HFRPCNT",
        "review_title": "Perfect Fit and comfort",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "I recently got my hands on the Merrell Unisex-Adult's Wool Everyday Hiking Socks in the 3 Pair Pack with Cushion Arch, and they've quickly become an essential part of my outdoor gear. These socks provide exceptional comfort with their well-designed cushioning, particularly in the arch area, making long hikes and outdoor activities far more enjoyable. Even in cooler weather, the wool blend in these socks keeps my feet warm without causing overheating, striking a perfect balance between insulation and breathability. Moreover, their durability is impressive; they've proven to be exceptionally resilient even with regular use and washing, showing no signs of wear or thinning. Additionally, these socks stay in place during hikes, ensuring that they don't slide down or bunch up, which is essential for preventing blisters and discomfort. Their unisex design is also convenient, making them suitable for both men and women. While they may be on the pricier side compared to other hiking socks, the quality and performance they deliver make them a worthwhile investment for outdoor enthusiasts. If you enjoy spending time outdoors, I highly recommend giving these Merrell hiking socks a try—they might just become your go-to choice for your outdoor adventures.",
        "helpful_votes": 14
    },
    {
        "user_name": "Rich",
        "user_id": "AE3MNS276BZAKD42SUKPJEGV4FNQ",
        "product_title": "Amazon Essentials Men's Slim-Fit Long-Sleeve Waffle Henley Shirt",
        "average_rating": 4.5,
        "total_rating": 3517,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Shirts",
        "features": {
            "Fabric type": "60% Cotton, 40% Polyester",
            "Care instructions": "Machine Wash Warm, Tumble Dry",
            "Origin": "Imported",
            "Neck style": "Henley Neck"
        },
        "description": "SLIM FIT: Slim fit through the shoulders, chest, and waist., LIGHTWEIGHT WAFFLE THERMAL: A super soft cotton blend, knit in a waffle texture., EVERYDAY HENLEY: Perfect on its own or layered, this henley is a versatile, year-round closet staple., DETAILS: Ribbed trim at neckline and sleeve cuffs, three button center front placket, and back neck half moon detailing.",
        "product_asin": "B07QJQ91F1",
        "review_title": "Do You Even Lift Bro?",
        "verified_purchase": true,
        "review_rating": 4.0,
        "text": "Then this henley is the one for you!\nJust the right tight and not the wrong loose, Amazon Essentials always delivers.\n\nI'm 5'7\", around 160 lbs and I like to workout so normally I wear a Medium in most shirts, I got a Small instead.\nI know it's already slim-fitting but with this brand, they run big so I've noticed to get that nice proper slimmed down look, you need to size down.\n\nSome pros for you guys:\n- The material has a nice feel to it especially with the waffle thing going on and isn't too light or too heavy. Just a very good weight to it.\n- The length is also perfect for someone around my height.\nNot too short or too long (I took a picture with my arm raised so you can see where it lands).\n- The sleeve width is just how I like it where it hugs the arm but doesn't restrict any movement especially when I pull the sleeve up (since it's cotton, it's gonna stretch anyway until you wash/dry it) and doesn't have too much fabric hanging when I bend over or crouch down which is what I often look for (some brands just have too much and makes you look like a sloppy bum).\n- The underarm has enough room to not rub your armpit when moving around either (rashes are no bueno).\n\nJust know that since it's cotton, it might shrink up a whole lot after drying but if you do it on a low setting or hang it up right after, it should be fine.\nAll in all, I just know what to expect from the Amazon brand and they are always an awesome value for the price. I had to knock a star off for the buttons being misaligned but I let them know and they sent me a replacement for free which is something I've never had to do.\n\nI took a few pictures just to help you out with making a great decision! :D",
        "helpful_votes": 39
    },
    {
        "user_name": "Deviled Egg",
        "user_id": "AGL2SCGPWD3GDELEN3JG4ZYFZPOA",
        "product_title": "Crocs Unisex Classic All Terrain Camo Clogs, Walnut, numeric",
        "average_rating": 4.6,
        "total_rating": 22956,
        "product_category": "Clothing, Shoes & Jewelry, Women, Shoes, Mules & Clogs",
        "features": {
            "Fabric type": "92.5% Eva, 7.5% Polyester",
            "Care instructions": "Machine Wash",
            "Origin": "Imported",
            "Sole material": "Ethylene Vinyl Acetate"
        },
        "description": "Crocs For Everyone: Crocs Classic All Terrain Clogs Have Rugged Lug Outsoles With Enhanced Tread For Increased Traction And Support. This Men'S And Women'S Clog Is Ready For It All, Even In The Harshest Environments., Lightweight And Fun: The Crocs For Men And Women Feature Lightweight Iconic Crocs Comfort. Ventilation Ports Add Breathability And Help Shed Water And Debris Quickly., , , ",
        "product_asin": "B07TXW5681",
        "review_title": "Comfortable and secure fit",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "My first pair of Crocs. I wasn’t in the market until I spoke to a distance hiker (Appalachian Trail, Pacific Crest Trail, Continental Divide Trail, etc) who has hiked thousands of miles, all in Crocs! He reported so many virtues (light weight, waterproof, easy on off, handy ejection of pebbles etc) that I decided to try a pair.\nThey are all the things reported except one: they don’t exactly fit my arch and foot shape. They are good, comfortable, but not an exact fit.\nI’ve walked probably 10 miles in them in half mile chunks. Good cushion, weather proof, easy to clean, secure straps, easy on/off, comfortable enough. For what I use them for (walk the dog, garden, wash the car, hot weather hikes) they work fine.",
        "helpful_votes": 17
    },
    {
        "user_name": "Jacob Brown",
        "user_id": "AHAIJWCLKTSSSC5FNF3267GS2O7A",
        "product_title": "McDavid mens Classic",
        "average_rating": 4.3,
        "total_rating": 1218,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Active, Athletic Supporters",
        "features": {
            "Fabric type": "Latex,Polyester,Mesh",
            "Care instructions": "Hand Wash Only",
            "Origin": "Imported"
        },
        "description": "SUPPORTIVE & COMFORTABLE: The McDavid Athletic Supporter 2-Pack is a comfortable, supportive option for staying safe in high-impact or strenuous sports and activities. It's easy to wear, features a durable design and comes with two pairs per package., EASY TO WEAR: The supporter is a classic, minimalist design, designed to be durable with a quick-to-dry stretch-mesh pouch., SUPPORTIVE, PROTECTIVE FIT: This jockstrap is suitable for athletes in Baseball, Softball, Football, Lacrosse and contact sports. HSA/FSA Eligible., , ",
        "product_asin": "B003E3ZU4G",
        "review_title": "Perfect",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "I bought these for working out. They are comfortable and perfect for active wear. I wear them under my tights for support and they do the job.",
        "helpful_votes": 12
    },
    {
        "user_name": "Haynrange",
        "user_id": "AH2V6EMLYGNXWUVV22QNKNURG63A",
        "product_title": "ATG by Wrangler Men's Synthetic Utility Pant",
        "average_rating": 4.8,
        "total_rating": 6,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Pants, Casual",
        "features": {
            "Fabric type": "96% Nylon, 4% Spandex",
            "Care instructions": "Machine Wash",
            "Origin": "Imported",
            "Closure type": "Zipper"
        },
        "description": "QUICK DRYING. Whether you are crossing wet areas hiking or encounter unexpected rain, these quick-drying utility pants are coated with a water repellent finish to keep you dry through any conditions you may come across., STRETCH COMFORT. Move with confidence throughout your day in these versatile straight leg pants. The gusseted crotch adds extra mobility. A regular seat and thigh provide a comfortable fit., ADDED PROTECTION. The perfect pants for outdoor activities, you can rest assured you'll stay well protected from the sun with UPF 30 protection., , , ",
        "product_asin": "B0B6DDCG3V",
        "review_title": "Sizing is off ! Very comfortable and strechy",
        "verified_purchase": true,
        "review_rating": 4.0,
        "text": "The waist and length is bigger than other pants I own. I wear 36/32 and these were more like 38/36. Last picture is my usual 36/30 pants next to these and the inseam difference is a lot, tags both say 36/30. I wish they would list front rise and outseam measurements with all clothing. Not sure why a well known brand be that off with there measurements compared to all the other brands that I own.",
        "helpful_votes": 13
    },
    {
        "user_name": "Rebecca S",
        "user_id": "AF3IKOSP3NAYXLHM4K23DGGIQGKQ",
        "product_title": "Vionic Pismo Womens Casual Supportive Sneaker",
        "average_rating": 4.5,
        "total_rating": 3752,
        "product_category": "Clothing, Shoes & Jewelry, Women, Shoes, Fashion Sneakers",
        "features": {
            "Fabric type": "Cotton-blend",
            "Origin": "Imported"
        },
        "description": "Upper: Eco-conscious eco-certified cotton canvas., Closure: Stretch Cotton Laces., Foot Bed: Removable Twill Covered EVA.",
        "product_asin": "B08RN8FSPT",
        "review_title": "My new favorite!",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "I have a hard time finding shoes that are comfortable, cute and have arch support. I’ve worn these for three days in a row with no problems. My feet feel great. It’s usually Brooks or Birkenstock for me. These are definitely cuter.",
        "helpful_votes": 21
    },
    {
        "user_name": "Chase Sinclair",
        "user_id": "AHWW3HJKVEA5JH46AVV62Q7TWTCA",
        "product_title": "Gildan Mens Brief Underwear Multipack",
        "average_rating": 4.4,
        "total_rating": 10543,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Underwear, Briefs",
        "features": {
            "Fabric type": "Solids: 100% Cotton; Sport Grey: 90% Cotton, 10% Polyester; Dark Heather: 65% Polyester, 35% Cotton",
            "Care instructions": "Hand Wash Only"
        },
        "description": "Soft, breathable cotton, Tag-free plush waistband, Contoured pouch with side fly for superior fit, Moisture wicking technology keeps you cool and dry, Stay-put leg bands for a no-ride-up fit",
        "product_asin": "B077ZRPH5C",
        "review_title": "The Best Tight Whities on the Market",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "As a self proclaimed tighty whities enthusiast, these Gildan briefs have my vote for best 100% cotton briefs on the market. The quality in these is that which you'd expect to see in significantly more expensive brands yet the prices are those of some of the cheapest brands out there.\n\nSo far the durability has held up just fine through 20+ wash cycles. And they are extremely comfortable for everyday wear. I wear them to the gym, lounging around the house and they're probably my favorite \"pajamas\" 😄.\n\nOverall, you're getting a good quality product and not spending much to get it. Definitely recommend!",
        "helpful_votes": 34
    },
    {
        "user_name": "G.",
        "user_id": "AFYNZLESBNI7Z4PIVKGJ52MV3GDQ",
        "product_title": "American Apparel Unisex Tri-Blend Track T-Shirt, Style GTR401, 2-Pack",
        "average_rating": 4.3,
        "total_rating": 1058,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Shirts, T-Shirts",
        "features": {
            "Fabric type": "50% Polyester, 25% Cotton, 25% Rayon",
            "Care instructions": "Machine Wash",
            "Origin": "Imported",
            "Closure type": "Pull On"
        },
        "description": "Relaxed fit, side seamed body, Classic width, rib collar, Taped neck and shoulders for comfort and durability, Removable tear away label, Great for DTG, embroidery, heat transfer, screen print",
        "product_asin": "B07WV6CHSN",
        "review_title": "Made by Gildan Active wear in Honduras.",
        "verified_purchase": true,
        "review_rating": 3.0,
        "text": "Not True American Apparel made in LA\nThis was made by Gildan Active wear in Honduras.\nApparently the original owner of AA bankrupt the company and sold it to Hold an.\nIts soft but different compared to OG AA tri -blend",
        "helpful_votes": 44
    },
    {
        "user_name": "mark tomboulian",
        "user_id": "AEWBYQGKDAFBXSBT7I7FUL2L6MJA",
        "product_title": "HOT FEET 4 Pack Work Socks for Men & Women - Breathable Boot Hiking Socks, Moisture Wicking Thick Wool Socks, Sizes 6-12.5",
        "average_rating": 4.5,
        "total_rating": 6170,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Active, Athletic Socks",
        "features": {
            "Fabric type": "62% Polyester, 20% Wool, 15% Nylon, 3% Spandex",
            "Care instructions": "Machine Wash",
            "Origin": "Imported",
            "Fit type": "Regular"
        },
        "description": "Keep Your Feet Cool and Dry - Our boot socks for men are made with breathable fabric to keep your feet cool and dry all day long. They’re made from a wool blend for cushioning, stretch, and support., Outdoor Socks - For those who work outdoors or enjoy camping, hiking, and hunting, these wool hiking socks men are a perfect choice. They will protect your feet from blisters., Made Especially For Men - These fit USA men’s sock sizes 6–12.5, making them one-size-fits-most. They were designed to stay in place without restricting your legs., , ",
        "product_asin": "B0D8QLMYHB",
        "review_title": "Although still good, not as good as it was",
        "verified_purchase": true,
        "review_rating": 3.0,
        "text": "Working outside during cold weather, I have found this sock variety to be outstanding for it's warmth and a much better alternative to cotton, which gets wet and cold, and wool, which does some of the same. The combination of materials in these socks is overall good\n\nBUT, and it's a big BUT....I just purchased these again using the \"buy it again\" feature, and this is not the same product. As you can see in the picture, the upper (new) version is much thinner, stretchier, and longer. The new version, although still warm, is not at all of the same quality and durability as the old one, and the fiber percentages have changed. So it is actually not \"Buy it again\" similarity, and the product picture on Amazon is of the older version, not the newer. I'm keeping it, but won't buy any more. Typical bait and switch deception...",
        "helpful_votes": 12
    },
    {
        "user_name": "Matty13",
        "user_id": "AGWJYWHMRWLPI62BEC332LAUKFAA",
        "product_title": "DAVID ARCHY Mens Underwear Cotton Soft Breathable Moisture-Wicking Horizontal Fly Boxer Briefs for Men 3 Pack",
        "average_rating": 4.6,
        "total_rating": 1397,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Underwear, Boxer Briefs",
        "features": {
            "Fabric type": "93% Cotton, 7% Spandex",
            "Care instructions": "Machine Wash",
            "Origin": "Imported"
        },
        "description": "SUPIMA COTTON UNDERWEAR MEN: Men's underwear made from supima cotton are softer,more durable and breathable than those made from regular cotton,keeping you fresh all day long. The premium fibers ensure that the cotton boxers for men are more comfortable retain color longer and are less prone to pilling., HORIZONTAL FLY & 3D POUCH: Our mens cotton boxer briefs with horizontal fly for convenience when you need to use them. The 3D pouch of the mens pouch underwear provides plenty of support and will allow you to relax to your most natural state., , , ",
        "product_asin": "B0B28WQ4WC",
        "review_title": "Great, but...",
        "verified_purchase": true,
        "review_rating": 4.0,
        "text": "These are great, but the pouch does not provide separation from the berries and legs as I thought.... not enough space. Love the horizontal fly... totally the easy way to go for work and when you are wearing tucked in shirt or belt. The pouch just isn’t as nice or roomy as other David Archy products. For this reason, I won’t buy more. However, amazing quality, as expected. Amazing material, as expected. And overall a great pair of undies. If you are looking for good separation for balls and legs go with David archy bamboo no fly. They need to adjust this pouch for more space!",
        "helpful_votes": 10
    },
    {
        "user_name": "MaFanYow",
        "user_id": "AF4KVFBAB6ICPXS5PZE5XTHEDCPQ",
        "product_title": "NORTIV 8 Men's Military Tactical Work Boots Hiking Motorcycle Combat Boots",
        "average_rating": 4.4,
        "total_rating": 16025,
        "product_category": "Clothing, Shoes & Jewelry, Men, Uniforms, Work & Safety, Shoes, Military & Tactical",
        "features": {
            "Sole material": "Rubber",
            "Shaft height": "8 Inches",
            "Outer material": "Leather+Fabric",
            "Closure type": "Zip"
        },
        "description": "Protection & convenience: Ankle-high protection wraps & supports the ankles.YKK side zipper with hook-loop strap closure is easy to take on/off., Durable & breathable：Breathable fabric keeps your feet cool and dry. And high abrasion-resistant leather provides full protection. This combination structure offers maximum comfort and ensures breathable and long-term protection at the same time., , , ",
        "product_asin": "B07V69VLFS",
        "review_title": "8\" Better Than 6\"",
        "verified_purchase": true,
        "review_rating": 4.0,
        "text": "I have bought the 8 inch Nortiv 8 boots before and they were very comfortable. These 6 inch Nortiv 8 boots are less comfortable mostly because the shaft is shorter.\n\nBecause the shaft is shorter, the opening is narrower and makes it harder to get my foot into the boot The 8 inch boot opens wider (probably because the shaft is taller) and the shaft acts as a shoe horn to help guide my foot into the boot.\n\nBecause the shaft is shorter, the collar rubs against my leg above the ankle as I walk. A little bit more padding on the collars of these boots would have fixed the problem. The collar of the 8 inch shaft sits higher on my calf and does not move much relative to my leg as I walk.\n\nOther than these shortcomings, the 6 inch boots are as comfortable as the 8 inch boots and require little break in. These boots have a lot of grip (on dry pavement) so be careful to not make sudden turns so as not to twist your ankles.\n\nAnother minor issue is the way the boots were packaged. They arrived with the laces going from the outside through the eyelets to the inside (see pictures). To tie the boots, I have to first pull the laces out of the top eyelets. (I do not know how to tie the boots from the inside, fcol.) The problem is there are eyelets on the outside of the boots, but only holes on the inside. This makes the hard ends of the laces difficult to line up with the eyelets and be pulled through. This took quite a bit of effort as I didn't want to damage the laces in case I have to return these boots. I wish Nortiv 8 would just lace these boots ready to be used than to make them look good. This would not be a problem if you wear your boots like the models with the ends of the laces tucked inside your boots!!",
        "helpful_votes": 13
    },
    {
        "user_name": "Jacob Brown",
        "user_id": "AHAIJWCLKTSSSC5FNF3267GS2O7A",
        "product_title": "McDavid mens Classic",
        "average_rating": 4.3,
        "total_rating": 1218,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Active, Athletic Supporters",
        "features": {
            "Fabric type": "Latex,Polyester,Mesh",
            "Care instructions": "Hand Wash Only",
            "Origin": "Imported"
        },
        "description": "SUPPORTIVE & COMFORTABLE: The McDavid Athletic Supporter 2-Pack is a comfortable, supportive option for staying safe in high-impact or strenuous sports and activities. It's easy to wear, features a durable design and comes with two pairs per package., EASY TO WEAR: The supporter is a classic, minimalist design, designed to be durable with a quick-to-dry stretch-mesh pouch., SUPPORTIVE, PROTECTIVE FIT: This jockstrap is suitable for athletes in Baseball, Softball, Football, Lacrosse and contact sports. HSA/FSA Eligible., , ",
        "product_asin": "B003E3ZU4G",
        "review_title": "Perfect",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "I bought these for working out. They are comfortable and perfect for active wear. I wear them under my tights for support and they do the job.",
        "helpful_votes": 12
    },
    {
        "user_name": "Rich",
        "user_id": "AE3MNS276BZAKD42SUKPJEGV4FNQ",
        "product_title": "Amazon Essentials Men's Slim-Fit Long-Sleeve Waffle Henley Shirt",
        "average_rating": 4.5,
        "total_rating": 3517,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Shirts",
        "features": {
            "Fabric type": "60% Cotton, 40% Polyester",
            "Care instructions": "Machine Wash Warm, Tumble Dry",
            "Origin": "Imported",
            "Neck style": "Henley Neck"
        },
        "description": "SLIM FIT: Slim fit through the shoulders, chest, and waist., LIGHTWEIGHT WAFFLE THERMAL: A super soft cotton blend, knit in a waffle texture., EVERYDAY HENLEY: Perfect on its own or layered, this henley is a versatile, year-round closet staple., DETAILS: Ribbed trim at neckline and sleeve cuffs, three button center front placket, and back neck half moon detailing.",
        "product_asin": "B07QJQ91F1",
        "review_title": "Do You Even Lift Bro?",
        "verified_purchase": true,
        "review_rating": 4.0,
        "text": "Then this henley is the one for you!\nJust the right tight and not the wrong loose, Amazon Essentials always delivers.\n\nI'm 5'7\", around 160 lbs and I like to workout so normally I wear a Medium in most shirts, I got a Small instead.\nI know it's already slim-fitting but with this brand, they run big so I've noticed to get that nice proper slimmed down look, you need to size down.\n\nSome pros for you guys:\n- The material has a nice feel to it especially with the waffle thing going on and isn't too light or too heavy. Just a very good weight to it.\n- The length is also perfect for someone around my height.\nNot too short or too long (I took a picture with my arm raised so you can see where it lands).\n- The sleeve width is just how I like it where it hugs the arm but doesn't restrict any movement especially when I pull the sleeve up (since it's cotton, it's gonna stretch anyway until you wash/dry it) and doesn't have too much fabric hanging when I bend over or crouch down which is what I often look for (some brands just have too much and makes you look like a sloppy bum).\n- The underarm has enough room to not rub your armpit when moving around either (rashes are no bueno).\n\nJust know that since it's cotton, it might shrink up a whole lot after drying but if you do it on a low setting or hang it up right after, it should be fine.\nAll in all, I just know what to expect from the Amazon brand and they are always an awesome value for the price. I had to knock a star off for the buttons being misaligned but I let them know and they sent me a replacement for free which is something I've never had to do.\n\nI took a few pictures just to help you out with making a great decision! :D",
        "helpful_votes": 39
    },
    {
        "user_name": "Tiffany",
        "user_id": "AED3LNWAZTM5KKWZRVPVBAI6SWBQ",
        "product_title": "CRZ YOGA Womens High Neck Workout Tank Tops - with Built-in Shelf Bra Racerback Athletic Sports Shirts",
        "average_rating": 4.4,
        "total_rating": 1168,
        "product_category": "Clothing, Shoes & Jewelry, Women, Clothing, Active, Active Shirts & Tees, Tank Tops",
        "features": {
            "Fabric type": "Naked Feeling Soft Fabric: 81% Polyamide, 19% Elastane",
            "Care instructions": "Machine Wash",
            "Origin": "Imported",
            "Closure type": "Pull On"
        },
        "description": "Designed for yoga or lounge., Naked Feeling Soft collection: Ultra soft and so comfortable, with great breathability and brushed handfeel., Slim fit, hip length., Built-in shelf bra with removable pads for extra support., High scoop neck for more coverage. Racerback design.",
        "product_asin": "B0B6JFV5J1",
        "review_title": "My absolute favorite",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "This is the same feel as a skims or the Amazon ReoRia Women's Sexy Sleeveless Racer Back Halter Neck Bodysuit Tank Tops but it has the most perfect built in bra!!!!!\nThe material is AMAZING! I am a 34e size 6-8 and I love how this fits, it really keeps the girls in place. Oh I got a medium which says 8-10. I seriously want to wear this everyday it’s so comfortable and flattering",
        "helpful_votes": 11
    },
    {
        "user_name": "craig",
        "user_id": "AG3VSVRX26CEVX7H452Q6QNJJY3Q",
        "product_title": "Ohoo Mens Slim Fit Lightweight Zip Up Hoodie with Pockets Long Sleeve Full-Zip Hooded Sweatshirt",
        "average_rating": 4.5,
        "total_rating": 9170,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Fashion Hoodies & Sweatshirts",
        "features": {
            "Fabric type": "80% Cotton, 20% Polyester",
            "Care instructions": "Machine Wash",
            "Origin": "Made in Korea",
            "Closure type": "Zipper"
        },
        "description": "ITEM MODEL NUMBER : DCF002, FEATURES : Convenient inside hidden pocket, Full zip closure with a white color string and zipper, Ribbed trims at the cuffs and waistband for a comfortable, Special double-sided fabric is both lightweight and soft, OCCASION : Game nights with friends, Outdoor activities, such as hiking or biking, Sports events, Skateboarding or rollerblading, Streetwear style, Attending a concert or live performance and more occasion, , ",
        "product_asin": "B075ZRQVFL",
        "review_title": "The perfect hoodie",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "5’10”, 160lbs, 31” waist, 40” chest. Purchased a Medium in camel and in burgundy. I liked them so much, I went back and bought in green and gray. Comparable hoodies from other sellers are nearly twice the price, and are of lower quality in my opinion.\n\nFits perfectly for a slim/athletic build. Cuffs are nice and snug, and the cut through the chest and waist is slim enough to be flattering, but not so tight that you look like a bozo.\n\nMaterial is very soft, and lightweight. Good enough for layering, but don’t expect it to keep you warm in severe cold. I’ve only had them for a couple/few weeks, so I can’t comment on the durability.\n\nIt’s great that they come in nearly every color imaginable, and there doesn’t seem to be any inventory shortages. Colors are pretty true to the pictures, though I’d say the green looks a little brighter/paler in the picture relative to the actual hoodie, which is a slightly darker green. The other three colors I have are spot on.\n\nThanks! Been looking for a good hoodie, and the others I’ve tried have disappointed.",
        "helpful_votes": 12
    },
    {
        "user_name": "akas",
        "user_id": "AEKRVIARGYRBE6OWRAEP7D2MXSVQ",
        "product_title": "Women's Floral Print Puff Sleeve Kimono Cardigan Loose Cover Up Casual Blouse Tops",
        "average_rating": 4.4,
        "total_rating": 68472,
        "product_category": "Clothing, Shoes & Jewelry, Women, Clothing, Swimsuits & Cover Ups, Cover-Ups",
        "features": {
            "Fabric type": "95% Polyester, 5% Other Fibers",
            "Care instructions": "Machine Wash",
            "Origin": "Imported"
        },
        "description": "Floral Cardigan,Casual summer plus size tops,Kimono beach cover ups,Chiffon shirts,Open Front,Lace Patchwork ,Loose Puff Sleeve, Its material is made of chiffon ,the fabric is sheer, airy ,feels sofe, lightweight and comfortable., The kimono can be over your tank tops or cut off shorts, even a tunic and leggings, further more the sundress,the floral kimono is the fashionable way to dress it up in the summer days., It's suit for daily casual,at home, outdoor, hawaiian beach,street,any other occasion for summer days, ",
        "product_asin": "B07DWYJMGQ",
        "review_title": "Best Cardigan",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "I looked at and tried so many different cardigans. None of them looked good. The pictures were nice and the items were as pictured but once I tried them on, there was something missing. They were too floral or just unappealing altogether. This one was perfect. From the picture, I thought it has some embroidery, but it doesn't. The entire design is in the fabric but it still looks really good. It does the job of wanting to wear shorts or jeans and either style it up or just give a little appeal to otherwise unappealing shorts.",
        "helpful_votes": 13
    },
    {
        "user_name": "Amazon shopper",
        "user_id": "AFFG5AYQR7HE3DDWVOYJPZN46SYA",
        "product_title": "Tanming Linen Pants for Women Summer Casual High Waisted Drawstring White Beach Pant",
        "average_rating": 3.9,
        "total_rating": 1639,
        "product_category": "Clothing, Shoes & Jewelry, Women, Clothing, Pants, Casual",
        "features": {
            "Fabric type": "85% Cotton, 15% Linen",
            "Care instructions": "Hand Wash Only",
            "Origin": "Imported",
            "Closure type": "Drawstring"
        },
        "description": "White linen pants women made of the breathable and lightweight fabric, super soft and comfy. ❤the white is a little see through, Features: elastic waist cotton linen pants for women, tapered leg, side convenient pockets, waist drawstring, ankle length, Occasion: womens linen jogger pants good for resort wear, casual daily, dating, party, vacation, lounge wear, summer beach pants for women, Matches: black khaki linen pants women are easily to pair with the t shirt, tank tops and sandals to have the loose fit look, simple but fashion, ",
        "product_asin": "B0BRK4XDC3",
        "review_title": "Love these",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "I really liked these linen pants. There is a slight pattern to them. After wearing I did wash and try on again to make sure they would still fit. I didn’t hand wash as directed but washed on normal cycle with my whites (warm). I threw in dryer for 10 minutes and then hung them on a drying rack to finish drying. I didn’t notice any shrinking. These are a little long on me but I still like them. For reference I bought the size large and I’m 5’3”, 180 pounds.",
        "helpful_votes": 11
    },
    {
        "user_name": "Tyler Howard",
        "user_id": "AEJ6VQBB3O5BHXRW4SSUFIKBHJ7A",
        "product_title": "McDavid mens Classic",
        "average_rating": 4.3,
        "total_rating": 1218,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Active, Athletic Supporters",
        "features": {
            "Fabric type": "Latex,Polyester,Mesh",
            "Care instructions": "Hand Wash Only",
            "Origin": "Imported"
        },
        "description": "SUPPORTIVE & COMFORTABLE: The McDavid Athletic Supporter 2-Pack is a comfortable, supportive option for staying safe in high-impact or strenuous sports and activities. It's easy to wear, features a durable design and comes with two pairs per package., EASY TO WEAR: The supporter is a classic, minimalist design, designed to be durable with a quick-to-dry stretch-mesh pouch., SUPPORTIVE, PROTECTIVE FIT: This jockstrap is suitable for athletes in Baseball, Softball, Football, Lacrosse and contact sports. HSA/FSA Eligible., , ",
        "product_asin": "B003E3ZU4G",
        "review_title": "Good - size chart",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "Perfect, comfy, functional, sexy. Just what I was looking for. And because I don't believe there's a size chart here on Amazon, I'll attach a photo of the one on the packaging. I got a small (my waist is 29) and it fits very well.",
        "helpful_votes": 67
    },
    {
        "user_name": "J",
        "user_id": "AGLQOFPBR3XHFFMDC75W7XQ5XZZA",
        "product_title": "adidas Unisex Alphabounce 2.0 Slides Sandal",
        "average_rating": 4.7,
        "total_rating": 2698,
        "product_category": "Clothing, Shoes & Jewelry, Men, Shoes, Athletic, Sport Sandals & Slides",
        "features": {
            "Origin": "Made in the USA or Imported",
            "Sole material": "Synthetic Rubber",
            "Outer material": "Synthetic",
            "Closure type": "Hook & Loop"
        },
        "description": "Comfortable slides for versatile wear, SNUG FIT: Two-piece hook-and-loop bandage upper for adjustable fit, SOFT LINING: Foam lining provides comfort, CONTOURED FOOTBED: Contoured footbed offers step-in comfort, BOUNCE: Lightweight Bounce cushioning provides enhanced comfort and flexibility",
        "product_asin": "B098RDWVLD",
        "review_title": "I love these",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "These slides are amazing. They have next level comfort and the fit is perfect. They look great and wipe down easily with a baby wipe to clean. They are true to size but expand just a bit after they are broken in (I don't mind that). I wear these everyday and these are my second pair. I'd still be wearing the first pair but I used them in the gym locker room shower and they soak up water like a sponge. They wound up stinking after not drying out properly. If you're looking for a great house shoe or something to throw on to run a quick errand, these are what you want. I wear them daily and feel confident saying that they are durable enough to last a year or longer. Will be buying a third pair once I wear these out.",
        "helpful_votes": 10
    },
    {
        "user_name": "Buddog",
        "user_id": "AG7Z4ZRKR5EGKMIAQ6XOAAWSJEDQ",
        "product_title": "Hanes Men's 5-Pack Ultimate Dyed Exposed Knit Boxer with ComfortFlex Waistband-Assorted Colors",
        "average_rating": 4.5,
        "total_rating": 5767,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Underwear, Boxers",
        "features": {
            "Fabric type": "100% Cotton",
            "Care instructions": "Machine Wash"
        },
        "description": "Our premium ComfortFlex waistband is soft and stretchable, Made with our 100% premium cotton, ComfortSoft fabric is the ultimate in comfort, Tag-free for itch-free comfort, No gap button fly front, Colors and print may vary",
        "product_asin": "B00ACIH62A",
        "review_title": "\"Assorted Colors\"",
        "verified_purchase": true,
        "review_rating": 3.0,
        "text": "\"Assorted colors\" is an understatement. I should have read the reviews.\n\nThis the equivalent of hiring someone to paint your house and they show you 5 color samples of various shades white/beige - when they get done your house is painted hot pink.\nThe picture the seller posted is an assorted color of grey to black - and that is what I assumed by \"assorted colors\" and \"colors may vary\".. what I got was various \"various patterns\" of fluorescent aqua blue (the picture doesn't do them justice). Your mileage may vary.\n\nOn the plus side: They fit as expected and are made from a very soft t-shirt like material.\n\n5 stars for comfort, shipping, price\n0 stars for misleading product picture\n\nWould not order again.",
        "helpful_votes": 48
    },
    {
        "user_name": "Buddog",
        "user_id": "AG7Z4ZRKR5EGKMIAQ6XOAAWSJEDQ",
        "product_title": "Hanes Men's 5-Pack Ultimate Dyed Exposed Knit Boxer with ComfortFlex Waistband-Assorted Colors",
        "average_rating": 4.5,
        "total_rating": 5767,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Underwear, Boxers",
        "features": {
            "Fabric type": "100% Cotton",
            "Care instructions": "Machine Wash"
        },
        "description": "Our premium ComfortFlex waistband is soft and stretchable, Made with our 100% premium cotton, ComfortSoft fabric is the ultimate in comfort, Tag-free for itch-free comfort, No gap button fly front, Colors and print may vary",
        "product_asin": "B00ACIH62A",
        "review_title": "\"Assorted Colors\"",
        "verified_purchase": true,
        "review_rating": 3.0,
        "text": "\"Assorted colors\" is an understatement. I should have read the reviews.\n\nThis the equivalent of hiring someone to paint your house and they show you 5 color samples of various shades white/beige - when they get done your house is painted hot pink.\nThe picture the seller posted is an assorted color of grey to black - and that is what I assumed by \"assorted colors\" and \"colors may vary\".. what I got was various \"various patterns\" of fluorescent aqua blue (the picture doesn't do them justice). Your mileage may vary.\n\nOn the plus side: They fit as expected and are made from a very soft t-shirt like material.\n\n5 stars for comfort, shipping, price\n0 stars for misleading product picture\n\nWould not order again.",
        "helpful_votes": 48
    },
    {
        "user_name": "Kindle Customer",
        "user_id": "AGSWJ4LWXYWM2MM4Q3WM36EOE2UA",
        "product_title": "Amazon Essentials Men's Short-Sleeve Quick-Dry UPF 50 Swim Tee",
        "average_rating": 4.6,
        "total_rating": 12412,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Swim, Rash Guard Shirts",
        "features": {
            "Fabric type": "100% Polyester",
            "Care instructions": "Machine Wash Cold, Tumble Dry",
            "Origin": "Imported",
            "Closure type": "Pull On"
        },
        "description": "SLIM FIT: Snug, slim fit through the shoulders, sleeves, chest, and waist, SWIM TEE: This swim top is designed for performance and all day comfort, ideal for swimming and spending a day outdoors in the sun. It provides the perfect amount of flexibility for optimal freedom of movement while swimming., DETAILS: Designed with short sleeves, raglan seams, and exposed flat seaming throughout to avoid irritation.",
        "product_asin": "B08P64FX7W",
        "review_title": "Not for swimming",
        "verified_purchase": true,
        "review_rating": 4.0,
        "text": "I bought this for my husband who felt self conscious getting into the pool after heart surgery. (very obvious scar on chest.). It looks great on him but he said that once it gets wet, it \" weighs like a ton of bricks.\"",
        "helpful_votes": 10
    },
    {
        "user_name": "KZrider",
        "user_id": "AGXBZ6Y6UP2XV2TEK4QJ7R7QE52Q",
        "product_title": "DEVOPS 3 Pack Men's Cool Dry Short Sleeve Compression Shirts, Sports Baselayer T-Shirts Tops, Athletic Workout Shirt",
        "average_rating": 4.5,
        "total_rating": 12118,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Active, Base Layers & Compression, Shirts",
        "features": {
            "Fabric type": "87% Polyester, 13% Spandex",
            "Care instructions": "Machine Wash",
            "Closure type": "Pull On",
            "Neck style": "Crew Neck"
        },
        "description": "【Designed for All-Season】Great Performance in warm or cool weather. Sweat and Moisture can be pulled away from skin very quickly; Enable sweat easy for air-dry to prevent clothes sticking to the body., 【Functional Fabric】 4-Way Stretch / Moisture Wicking / Two-Way Air Circulation / Quick-Dry, 【UV Sun Protection】 Rating UPF 50+ protects your skin from the sun's harmful UV rays., 【Comfortable】 Non abrasion spandex fabric with excellent elasticity and durability for maximum mobility., ",
        "product_asin": "B07PDB468P",
        "review_title": "Like everything but the collar",
        "verified_purchase": true,
        "review_rating": 3.0,
        "text": "I typically wear a wicking shirt everyday at work. I've been doing it for the past few years and most of them do what they say and fit like a typical t-shirt but with some compression. These shirts (Size Large) fit well everywhere on me and I'm 5'7\" @ 190lbs. Impressed with the fit, sleeve length, and fabric softness. The one downfall is the collar. It's way too big and when you pull the shirt up to get the collar to fit where a normal shirt would fit you get the infamous \"bacon collar\". Overall I can't wear these at work and they'll have to be used for working out. Pretty disappointed considering the good parts. If I could return them all I would.",
        "helpful_votes": 14
    },
    {
        "user_name": "Ammie",
        "user_id": "AGGBRMFUAQZNYQBCO2XNJAXNV5XA",
        "product_title": "Himosyber Women's Patchwork Dual Pocket Jumpsuit Loose Floral Print Bohemian Wide Leg Bib Overall",
        "average_rating": 4.2,
        "total_rating": 7454,
        "product_category": "Clothing, Shoes & Jewelry, Women, Clothing, Jumpsuits, Rompers & Overalls, Overalls",
        "features": {
            "Fabric type": "65% Cotton& 35% Polyester",
            "Care instructions": "Hand Wash Only",
            "Origin": "Imported"
        },
        "description": "Button down closure, color block with ethnic aztec floral printed, Special bib pockets and 2 hand pockets, ruffle pleated, loose fit, ankle length, a layering-friendly pull on jumpsuit with handy patch pockets and subtly tapered wide leg, Each color has a NEW DESIGN SIDE ZIPPER. There is a zipper on the side that makes it easy to take off. Wear it over a tee or on its own for the bohemian effect ( the straps were designed to cover a bra), Casual floral print button strap ethnic summer beach long lovely dungarees overall with pockets suitable for daily, dating, party, office, beach, vacation, club outifts wear, pair with t-shirt. There are two prints and different sizes of this ensemble, so please refer to the measurements in the last figure, ",
        "product_asin": "B091DYRMC2",
        "review_title": "Attention tall ladies! Different colors fit differently",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "I am almost 6 ft tall and 230 lb. Usually wear a size 18. I bought an XXL in the gray and it fits really well. Some people have noted that it's not for tall people. Well it does fit me just fine, but I am a tall person with a shorter torso. If you have a long torso this jumper may give you issues! A hand washed it and it still fits very nicely. It's so comfortable and breezy. So I ordered one in one of the patchwork colors, same size xxl. Xxl. However, it did not fit the same and it was about an inch and a half shorter than the gray one, even when the gray one was already washed and air-dried. I also noticed that the patchwork one was slightly different in the styling. The back had a gather in it at the top. I might have kept it if it fit. Just a little bit better. But I am sending the patchwork colored jumper back. All in all I would recommend this and if you really like it and it doesn't fit, maybe try a different color or pattern because the one I got and that fits is wonderful. Will get a lot of wear this summer 🙂",
        "helpful_votes": 25
    },
    {
        "user_name": "william M.",
        "user_id": "AENFIUBACH2TB3KGO3MSUNSB7BHA",
        "product_title": "Wishcotton Men's Moccasin Bootie Slippers With Cozy Memory Foam, Winter Warm Fuzzy Indoor Outdoor House Shoes",
        "average_rating": 4.5,
        "total_rating": 13565,
        "product_category": "Clothing, Shoes & Jewelry, Men, Shoes, Slippers",
        "features": {
            "Outer material": "Microsuede",
            "Closure type": "Lace up",
            "Water resistance level": "Waterproof"
        },
        "description": "A slipper combining a traditional moccasin stitched design with a wild hump-like collar. Thick plush lining can wrapped your foot in comfy warmth on chilly days, also add a luxurious look and feel., Special high back helps keep your ankle warm, also makes you walk more stable. With durable rubber sole, you do not need to change to your regular shoes when go for a short walk outside., Ultra soft insole contains high-density memory foam, EVA shock-absorbed pad and extra support foams. When you get home, slip on these cozy slippers, totally relax your feet after a long day of tiring driving and work., , ",
        "product_asin": "B07RJ3646F",
        "review_title": "Pricey But Decent",
        "verified_purchase": true,
        "review_rating": 4.0,
        "text": "I bought these 16mos ago and was instantly very happy with them. The memory foam and faux fleece lining felt very good on the feet. The fit was right, and the slippers were very warm. In the packaging there was a card that said something to the effect of “Please don’t return these slippers if they fit snuggly, wear them for a few days and the insides will matt down a bit and then they should fit true to size.” I found this to be exactly the case and after a few wears the slippers fit perfectly, felt great, and kept my feet feel snug as a bug in a rug.\n\nHowever it’s not been 16 mos and the slippers are falling off of my feet! Clearly my feet didn’t shrink which leaves me to conclude that the matting down process that they allude to on that aforementioned card does not stop after a few days. I think what actually happened is that after a time the memory foam begins to break down and deteriorate. In any case it’s been 16mos and I can no longer wear these slippers.\n\nThese slippers cost roughly 25%-50% more than most of the others I looked at, and for that cost I rather expect a longer life than 16mos. While these aren’t a bad slipper at their price point the math simply isn’t “mathing.” I know I could buy a pair of slippers at 2/3 the price and get the same longevity out of them as I’ve done it in the past.\n\nOverall, a decent slipper so I’m giving 4 stars, but deducting one star because I think that for the money they should go with a batter memory foam that doesn’t deteriorate so quickly.",
        "helpful_votes": 12
    },
    {
        "user_name": "Amazn Consumer RC",
        "user_id": "AFSYUMFIGHAAD7ZVE4LSCRPH72RA",
        "product_title": "Women's Capri Denim Jeggings High Waisted Pull on Stretch Cropped Skinny Pants Regular & Plus Size",
        "average_rating": 4.2,
        "total_rating": 1386,
        "product_category": "Clothing, Shoes & Jewelry, Women, Clothing, Leggings",
        "features": {
            "Fabric type": "65% Cotton;28%Polyester;7%Spandex",
            "Care instructions": "Machine Wash",
            "Origin": "Imported",
            "Closure type": "Pull On"
        },
        "description": "Soft Denim capri jean for women! Make from super soft and stretchy, comfy cotton blend knit denim fabric,adapts well to the body, Easy pull on style with wide elastic waistband; Design to look like your favorite real denim jean ,fit like the second skin hug leggings, Women's capris provide extra movement without bulk;Natural higher rise with flexible control panel to slim and smooth your body shape;No dreaded muffin top in these jeggings, , ",
        "product_asin": "B07TBPTGFG",
        "review_title": "Soft and comfortable! Great purchase.",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "These are very comfortable and the fabric is soft. It is not denim, but close enough for the price and comfort level. I have worn them for several hours and they have not expanded in size and ridden down as some of these types of pants are prone to do. I have already added another pair to my Amazon cart for purchase! They comes in so many nice colors. I like that they are not incredidibly tight fitting. I ordered XL to give myself plenty of room. The only thing I am not 100% satisfied about is the lines in the fabric (see photo). Other than that these are a great purchase.",
        "helpful_votes": 14
    },
    {
        "user_name": "RH",
        "user_id": "AHIWF4RTK47BGZGAMZO5IZXVFF3Q",
        "product_title": "Columbia Men's Backcast Iii Water Short",
        "average_rating": 4.4,
        "total_rating": 24,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Active, Active Shorts",
        "features": {
            "Fabric type": "100% Nylon",
            "Care instructions": "Machine Wash",
            "Origin": "Imported",
            "Closure type": "Button"
        },
        "description": "OMNI-SHADE: Be safe and protected. Omni-Shade blocks UVA and UVB rays to help prevent sunburns and long-term skin damage. The tight weave construction with UV absorbent yarns block the full spectrum of harmful UV rays., BUILT-IN SUN PROTECTION: Columbia Men’s Super Backcast Water Shorts guard against sun damage thanks to the built-in UPF 50 material. It’s a breathable, quick wicking fabric that pulls moisture away to keep you cool and dry when you're out of the water., , , , ",
        "product_asin": "B00DNNS5US",
        "review_title": "nice shorts, but ball breaking liner",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "Shorts are nice, light, good for swimming and not swimming. I usually cut out the liner of swim trunks and this is no exception. I wore them first to our club pool and it felt like a slow castration--both balls squeezed up in the body cavity somewhere. My wife cut out the liner so that they are comfortable for everyday wear or swimming. Boxers could be worn for swimming to prevent the see through effect.",
        "helpful_votes": 13
    },
    {
        "user_name": "Michael Lowe",
        "user_id": "AGAKQ5GNVP6Z6JOIHFLZHHGS4KWA",
        "product_title": "PAVOI 14K Gold Plated 3mm Cubic Zirconia Classic Tennis Bracelet | Gold Bracelets for Women | Size 6.5-7.5 Inch",
        "average_rating": 4.4,
        "total_rating": 27364,
        "product_category": "Clothing, Shoes & Jewelry, Women, Jewelry, Bracelets, Tennis",
        "features": {
            "Item display length": "6.5 inches",
            "Material": "Rose Gold",
            "Metal type": "Rose Gold",
            "Clasp type": "Lobster Claw",
            "Chain type": "Box Chain",
            "Gem type": "Cubic Zirconia"
        },
        "description": "Tennis bracelet featuring round 3mm AAAAA cubic zirconia stones in four-prong basket settings. Measures 6.5 inches in Length, Cubic Zirconia set in Lead-free, Eco-friend and hypoallergenic setting. This stunning bracelet is then Gold Plated to ensure a long-lasting and brilliant finish., , , ",
        "product_asin": "B07TCNX6J8",
        "review_title": "Perfect but not perfect",
        "verified_purchase": true,
        "review_rating": 4.0,
        "text": "Bought the Rose gold, 6.5 inch bracelet for my wife Valentine's day. She loved it, it looks so classy on the hand. HOWEVER, one annoying thing is the hook is difficult to unclip. To unclip this you really need to take you time, use strength, and try not to damage the bracelet; it is clipped tightly.",
        "helpful_votes": 15
    },
    {
        "user_name": "Chloe",
        "user_id": "AF6CFFKWG444GKVBPWCRHU7WYWIA",
        "product_title": "Newffr Women's Casual Blazer Long Sleeve Open Front Work Office Jacket with Pockets",
        "average_rating": 3.8,
        "total_rating": 417,
        "product_category": "Clothing, Shoes & Jewelry, Women, Clothing, Suiting & Blazers, Blazers",
        "features": {
            "Fabric type": "92% Polyester, 8% Spandex",
            "Care instructions": "Machine Wash",
            "Origin": "Imported"
        },
        "description": "",
        "product_asin": "B09VCC2PXY",
        "review_title": "VERY Wrinkly",
        "verified_purchase": true,
        "review_rating": 3.0,
        "text": "For an Amazon blazer, this is fine. I'm 5'6, an athletic 155 lbs and ordered a small. It fits the way I wanted it to. However, I do not like the material. It wrinkles TERRIBLY. I used a steamer and then tried to iron it out on the delicate setting and its still not wrinkle free. I got it in white so it's extremely noticeable how wrinkly it is.\n\nI prefer to be a little lower maintenance with my office attire so I plan to return this.",
        "helpful_votes": 22
    },
    {
        "user_name": "francis a benning jr",
        "user_id": "AFCUSHN3YF3TJLQB5VGVLTGV7KSA",
        "product_title": "Fruit of the Loom Men's Eversoft Cotton Stay Tucked Crew T-Shirt",
        "average_rating": 4.6,
        "total_rating": 125878,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Underwear, Undershirts",
        "features": {
            "Fabric type": "100% Cotton",
            "Care instructions": "Machine Wash",
            "Origin": "Imported",
            "Closure type": "Pull On"
        },
        "description": "6 Pack Black Crew T-Shirts, Stays tucked with a Layflat Collar, Wicks moisture, 6 pack Classic White Crew Undershirts, Soft covered seams on neck and shoulders for comfortable fit, Soft lay flat collar",
        "product_asin": "B09ZR4SGC8",
        "review_title": "The Perfect Undershirt for Everyday Wear!",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "I recently purchased the Fruit of the Loom Men's Eversoft Cotton Stay Tucked Crew T-Shirt and am extremely pleased with the quality and comfort they offer. This 6-pack of classic white crew undershirts is a staple in my wardrobe now, and here's why:\n\nMaterial and Build Quality: Made from 100% cotton, these shirts are soft and breathable. The fabric feels high-quality and doesn't thin out after several washes. The seams on the neck and shoulders are covered softly, ensuring no irritation or chafing, which is a significant plus for me.\n\nFit and Comfort: The classic fit allows for a full range of movement without restriction. True to their name, they stay tucked in all day long without bunching up, which is great whether you're wearing them under a dress shirt for work or under a flannel for a casual outing. The lay flat collar remains neat and crisp, enhancing the overall look.\n\nMoisture Management: These shirts do a fantastic job of wicking away moisture, keeping me dry and comfortable throughout the day, whether I'm in a meeting or getting things done around the house.\n\nCare Instructions: They are easy to care for—machine wash warm on a gentle cycle and tumble dry low. I've followed these instructions and have seen minimal shrinkage and no loss of color or quality.\n\nSustainability: I appreciate that these shirts are made with safer chemicals and have sustainability certifications like OEKO-TEX STANDARD 100. It's reassuring to know I’m wearing something that's friendlier to the environment.\n\nValue for Money: Considering the durability, comfort, and quality, these undershirts offer great value, especially in a 6-pack. They hold up well over time, making the investment worthwhile.\n\nCustomer Sentiment: Echoing other customers, I find these shirts exceptionally comfortable, well-fitting, and of high quality. Though some have noted issues with shrinkage and consistency in thickness, my experience has been overwhelmingly positive.\n\nIn summary, if you're looking for reliable, comfortable, and sustainable undershirts that won't break the bank, the Fruit of the Loom Men's Eversoft Cotton Stay Tucked Crew T-Shirts are an excellent choice. They meet all my needs for an everyday essential.",
        "helpful_votes": 35
    },
    {
        "user_name": "Chase Sinclair",
        "user_id": "AHWW3HJKVEA5JH46AVV62Q7TWTCA",
        "product_title": "Gildan Mens Brief Underwear Multipack",
        "average_rating": 4.4,
        "total_rating": 10545,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Underwear, Briefs",
        "features": {
            "Fabric type": "100% Cotton",
            "Care instructions": "Machine Wash",
            "Origin": "Imported",
            "Country of Origin": "Honduras"
        },
        "description": "Soft, breathable cotton, Tag-free plush waistband, Contoured pouch with side fly for superior fit, Moisture wicking technology keeps you cool and dry, Stay-put leg bands for a no-ride-up fit",
        "product_asin": "B0D17TMFQP",
        "review_title": "The Best Tight Whities on the Market",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "As a self proclaimed tighty whities enthusiast, these Gildan briefs have my vote for best 100% cotton briefs on the market. The quality in these is that which you'd expect to see in significantly more expensive brands yet the prices are those of some of the cheapest brands out there.\n\nSo far the durability has held up just fine through 20+ wash cycles. And they are extremely comfortable for everyday wear. I wear them to the gym, lounging around the house and they're probably my favorite \"pajamas\" 😄.\n\nOverall, you're getting a good quality product and not spending much to get it. Definitely recommend!",
        "helpful_votes": 34
    },
    {
        "user_name": "William I Putnam",
        "user_id": "AH7MDMLO3EM73YCMOEPS66RZFDEQ",
        "product_title": "Fruit of the Loom Men's Micro Stretch Boxer Briefs, Designed to Move with You, Lightweight & Moisture Wicking",
        "average_rating": 4.4,
        "total_rating": 35883,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Underwear, Boxer Briefs",
        "features": {
            "Fabric type": "92% Polyester, 8% Spandex",
            "Care instructions": "Machine wash cold. Use only non-chlorine bleach when needed. Do not use fabric softener. Tumble dry low. Do not iron.",
            "Origin": "Imported",
            "Country of Origin": "Vietnam"
        },
        "description": "Sizes S M L XL are pack of 5, Lightweight Microfiber Boxer Briefs, No Bulk, Moisture Wicking, Moves with You, Functional Fly",
        "product_asin": "B0D4VVPKRW",
        "review_title": "Amazing for the price",
        "verified_purchase": true,
        "review_rating": 4.0,
        "text": "I've bought two sets of these boxer briefs and they are excellent overall, especially for the price. I've worn ExOfficio and Duluth Trading Co. long boxer briefs before, and while those brands make an excellent product, one pair costs twice what a pack of four of these babies does. They are lightweight, comfortable, don't ride up or twist, and silky to the touch which is also kinda nice for putting on the pants. They slide right over with little resistance. I haven't had them long enough to know about long-term durability, but I've probably had them for 3-6 months and they're holding up well so far.\n\nMy only complaint was that the sizing seems a bit off. The first set I got was a medium (my normal size). They fit nicely in the waist and legs, but really end up tucking my fishing tackle up into an uncomfortable position. I'm not trying to walk around with nut huggers on. So for my next set I sized up to large, but I was worried they would be too big in the waist and legs. Not so! The large fits perfectly. I'd just recommend buying one size up from your normal size unless you like your junk crushed up tightly against the taint.\n\nUpdate: as for long term durability, they could be better. In several pairs, the back of the waistband elastic has done that thing where it gets all loose and wavey. However, I think this is mainly due to drying them. I try not to dry them in a dryer but hang to dry and that seems to help them last longer. Still, for the price it’s hard to go wrong.",
        "helpful_votes": 42
    },
    {
        "user_name": "Deiondre Spencer",
        "user_id": "AFTPD5BDB6LUOWXK4JC6E23RYWQQ",
        "product_title": "Men's Biker Denim Jogger Pants S-5XL",
        "average_rating": 4.2,
        "total_rating": 356,
        "product_category": "Clothing, Shoes & Jewelry, Men, Clothing, Jeans",
        "features": {
            "Fabric type": "97% Cotton, 3% Spandex",
            "Care instructions": "Machine Wash",
            "Origin": "Imported",
            "Closure type": "Drawstring"
        },
        "description": "97% Cotton / 3% Spandex / Machine washable, Elasticized Waist With Drawstring / Stretch fabric for Comfort, FIT : Slim Fit / Slightly Tapered Legs With Elasticized Cuffs, S=28-30 l M=32 l L=34 l XL=36 l 2XL=38 3XL=40 4XL=42 5XL=44, Please note that This image is copyrighted by law. We will take legal action if any seller use and modify this image",
        "product_asin": "B0CTLTP7GQ",
        "review_title": "Best Jean Joggers for the money!",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "I’m a bigger guy and have always worn sweat joggers over jeans because they fit better. But these are the best of both worlds! Same jogger style and stretch but Jean material. And best part they have belt loops! They seem very durable, I can bend and squat in these without a problem and haven’t had any signs of tearing/ripping. Very high quality jean material. The black pair has turned a lighter color after a few washes but I actually like how they look, gives them a more distressed look. I will definitely be buying these as my go to from now on. Highly recommend! I got a size 4xl and it fit my size 46 waist just fine",
        "helpful_votes": 11
    },
    {
        "user_name": "Amazon Customer",
        "user_id": "AHGKFPU5JRAVMLVFNAT3SX3U5UUA",
        "product_title": "YEOREO Amplify Leggings for Women Seamless Scrunch Leggings Butt Lifting Gym High Waisted Athletic Leggings",
        "average_rating": 4.1,
        "total_rating": 2937,
        "product_category": "Clothing, Shoes & Jewelry, Women, Clothing, Active, Leggings",
        "features": {
            "Fabric type": "92% Nylon, 8% Spandex",
            "Care instructions": "Machine Wash",
            "Origin": "Imported",
            "Closure type": "Elastic"
        },
        "description": "Soft Fabric :Both leggings are made with a buttery soft blend of materials. Seamless knitted fabric; High elasticity; Moisture wicking; No Pilling; Lightweight; No camel toe, Seamless Scrunch Leggings:Seamless scrunch leggings, Scrunch butt lifting, Ruched design shapes your booty and pushes up your booty naturally. These seamless scrunch leggings have thigh contour shadowing. They accentuate all the right curves and the shadowing enhances curves, High Waist Leggings:High-waist, Unique waist design for perfect waist support, Tummy control and Would not Fall, Ruched design, Surely passed the squat test, Leggings fit so well. These seamless scrunch leggings can be worn with your activewear top for a casual and easy-going outfit, , ",
        "product_asin": "B0CTCMSMRK",
        "review_title": "The BEST leggings EVER. I have 7 pairs.",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "I always thought leggings were so uncomfortable. I felt like they always cut off my gut, gave me a muffin top and slid down whenever I moved. THEN I had my first baby, and in my post partum period, I searched for seamless leggings. I ordered these and 3 other brands of similar price. Instantly these were the winners. Even before trying them on, the material is SO soft, yet thick, and stretchy. You cannot see through them at all. The butt scrunch is SO flattering but not ridiculous to where I feel weird in public. They don’t shrink or deteriorate in the wash, they have stayed just as soft as when I first got them. My favorite part about them is they don’t slide down, and give you that webbed feeling in the crotch area where you have to keep hiking them up. They are like a second skin, but thick, pretty darn warm and comfortable enough to sleep in. Other brands I tried were itchy catching on leg hair, and the waist band stretched out after a few hours to where they slide down. Can you tell I could go on and on about these?! Also they have never once snagged or got a whole and I have been wearing them daily for over a year now.",
        "helpful_votes": 23
    },
    {
        "user_name": "Red Valsen",
        "user_id": "AHIG6COLVAEZXMBML5ZBQUD2KYXA",
        "product_title": "Champion Men’s Sweatpants, Powerblend, Fleece Open-Bottom Sweatpants for Men (Reg. or Big & Tall)",
        "average_rating": 4.5,
        "total_rating": 18084,
        "product_category": "Clothing, Shoes & Jewelry, Men",
        "features": {
            "Fabric type": "50% Cotton, 50% Polyester",
            "Care instructions": "Machine Wash",
            "Origin": "Imported",
            "Closure type": "Front",
            "Country of Origin": "Honduras"
        },
        "description": "THE FIT – Standard-fit men's open-bottom sweatpants with an elastic waistband, adjustable drawcord, and 32\" inseam., THE FEEL – Midweight, 9 oz. warm and durable fleece that’s been brushed for softness., THE LOOK - Open hem streamlines your look with tees and sweatshirts., LOW PILL, LOW SHRINK – High-quality fleece fabrication designed to reduce pilling and shrinkage., , ",
        "product_asin": "B0BTNBCNQK",
        "review_title": "Precisely As Advertised",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "I purchased these Champion (a Hanes brand) sweatpants in navy blue size large on 1/3/2021. I am 6' 2\", 185-lbs. with a 36\" waist. The sweatpants are a little tight around the waist since they're new and elastic is still fresh, and wearing them with the bottom edge of the elastic waist on my hips, the cuff edges are below the tops of my low-cut Chuck Taylors but don't drag on the ground. In other words, they fit fine. Their construction is as advertised: medium weight, non-ribbed cuff (see photo) with beefy waist drawstring on the INSIDE of the waistband (where it belongs, out of sight). The texture is smooth on the outside, as in the vendor photo, and moderately fleecy on the inside. There is a nifty multi-color hang loop on the inner waistband, too. I found no loose or broken threads, and no holes. These are similar to an ancient pair of Wilson poly-cotton sweats I have that are slightly heavier. I washed the new Champions in lukewarm water and they don't appear to have shrunken. Well worth the $22.26 including tax. I plan to buy another pair before their availability evaporates like so many other finely-made consumer goods that have disappeared (but I'm just geezing).",
        "helpful_votes": 22
    },
    {
        "user_name": "thehwyman",
        "user_id": "AG3BX2GWAITHEX5EOLHED7QNXSBQ",
        "product_title": "Wmcaps Warm Beanie Hats for Men Women, Fleece Lined Beanie Warm Winter Caps Unisex Fashion Knit Cuffed Cap",
        "average_rating": 4.8,
        "total_rating": 475,
        "product_category": "Clothing, Shoes & Jewelry, Women, Accessories, Hats & Caps, Skullies & Beanies",
        "features": {
            "Fabric type": "50%Viscose, 30%Polyester, 20%Nylon",
            "Care instructions": "Machine Wash",
            "Closure type": "Snap",
            "Fit type": "Stretch"
        },
        "description": "[Warm Fleece Lined Beanie] Unlike the most beanie, winter ski caps for men are double layered, mens beanies cap has thick fleece lining inside, pretty warm and comfortable, don't be afraid of headache on extremely strong windy days anymore, enjoy your coziness time with family, friends during coldest winter when going out to play., [Skin-friendly Soft Material] Made of premium comfortable polyester fabric and pretty soft knitted, fleece lined hat is not only softer and skin-friendly to touch and wear than others, but won’t let you feel itchy at all. Warm beanie cap is ideal to keep your ears and head warm in cold winter, avoiding suffer from the biting cold wind., , , ",
        "product_asin": "B0CG9WYNFP",
        "review_title": "Really, REALLY nice cold weather cap!!",
        "verified_purchase": true,
        "review_rating": 5.0,
        "text": "This is a great cold weather winter cap. Its a one size fits all but has plenty of stretch for larger head diameters. FYI, I normally wear a 7 1/4 hat size and this cap fits me really well. The inside lining is very soft and the rolled outside cuff is plenty long enough to roll down in the back and cover my neck into my coat collar. Appears to quite well made.",
        "helpful_votes": 12
    },
    {
        "user_name": "purrbrat",
        "user_id": "AE2BIUQ3H3ZZGB2XVK44436PLIAA",
        "product_title": "Bates Women's Tactical Sport 2 Tall Side Zip Military Boot",
        "average_rating": 4.4,
        "total_rating": 632,
        "product_category": "Clothing, Shoes & Jewelry, Women, Uniforms, Work & Safety, Shoes, Military & Tactical",
        "features": {
            "Fabric type": "100% Leather",
            "Origin": "Made in the USA",
            "Sole material": "Rubber",
            "Shaft height": "Calf High"
        },
        "description": "Ground-gripping TacTRAX rubber outsole Full movement flexibility with outsole Flex Channels Outsole exceeds industry standards for slip resistant and oil resistant, Better ground connection with 11mm heel to toe drop Quick on/off YKK side zipper Energy returning lightweight CMEVA midsole, Built to last with durable full grain leather Lightweight and strong Performance Denier Polyester Actively pulls moisture away from foot with moisture wicking lining, Built to last with toe and heel outsole stitch Form fitting removable PU insert Made with an athletic last for better foot position, ",
        "product_asin": "B08TCPTZWM",
        "review_title": "Good lightweight duty boot.",
        "verified_purchase": true,
        "review_rating": 4.0,
        "text": "I always joked that if crocs made a duty boot, I would buy it. Seriously, these are almost as comfortable as my crocs that I wear for house shoes.\n\nThe good:\nSeriously comfortable.\nLightweight, as in even lighter than the Bates Ultralites they replaced.\nAffordable.\nLook professional and are polishable.\nSoles are holding up decently after a few months with use on multiple terrain types.\n\nThe bad:\nThe outsole looks to be starting to separate from the leather at the toe in a couple places.\nBreathability level is better for hot weather than cooler temperatures, so not the best choice for a year-round boot.\n\nI would likely buy again, but I am looking for something at this comfort level that will work better in colder temps.",
        "helpful_votes": 17
    },
    {
        "user_name": "Melissa Howes",
        "user_id": "AEKO67SO7PZ27DYY5DV7XSA73S2A",
        "product_title": "Under Armor Big Logo 5.0 Backpack",
        "average_rating": 4.6,
        "total_rating": 316,
        "product_category": "Clothing, Shoes & Jewelry, Luggage & Travel Gear, Backpacks, Casual Daypacks",
        "features": {
            "Fabric type": "95% Polyester/5% Elastane",
            "Care instructions": "Machine Wash",
            "Origin": "Imported"
        },
        "description": "UA Storm technology delivers an element-battling, highly water-resistant finish|Tough, abrasion-resistant bottom panel|Extra-soft, tricot lined laptop sleeve—holds up to 15\" laptop|Water-repellent front valuables pockets lined with tricot to keep your valuables safe|Adjustable, padded, HeatGear shoulder straps for total comfort|Ergonomic, padded back panel for optimal comfort|Two side water bottle pockets|Webbing loops & D-ring on front panel for added attachment points",
        "product_asin": "B01M26UAYO",
        "review_title": "Bad or No Warranty from Under Armour",
        "verified_purchase": true,
        "review_rating": 1.0,
        "text": "Purchased this backpack 3 months ago and after a week or two it started to get a tear at the bottom seem. After a three months the tear had opened into a big hole in the side. I contacted Under Armour support and they said since I did not buy it from ua.com they would not warranty it. I contacted Amazon and they stepped up and replaced the backpack. 5 Stars for Amazon support! Zero Stars for Under Armour for not supporting their product. I would not recommend buying any Under Armour product. Go to the Under Armour site and see if you can find any warranty information? I used to like the Under Armour product, but without a warranty it is garbage. Thanks again Amazon for the great support.",
        "helpful_votes": 18
    }
]